---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.Camera.NearDistance
source: html/3855ba19-2bbe-8d4e-cb40-18d406937d6b.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera.NearDistance Property

Distance to near clipping plane

## Syntax (C#)
```csharp
public double NearDistance { get; set; }
```